fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
</mdclass:DataProcessor>

fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom-main/fonecmid-diplom-main/diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТаблицу(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &КонецМесяца
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &НачалоМесяца
		|	И НЕ ДоговорыКонтрагентов.Ссылка В
		|		(ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Договор КАК Договор
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Дата <= &КонецМесяца
		|			И РеализацияТоваровУслуг.Дата >= &НачалоМесяца)";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Список = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
			
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Заполнить(Выборка.Ссылка);
		НовыйДокумент.Дата = Период;
		НовыйДокумент.ВыполнитьАвтозаполнение();	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		НовыйДокумент.ПроверитьЗаполнение();
		
		Список.Вставить(Выборка.Ссылка, НовыйДокумент.Ссылка);	
			
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти
